# VPHasCropObject

## Description
Indicates if specified viewport has a crop object.

```pascal
FUNCTION VPHasCropObject(viewportHandle : HANDLE): BOOLEAN;
```

```python
def vs.VPHasCropObject(viewportHandle):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|viewportHandle|HANDLE|Handle to viewport.|

## Version
Availability: from VectorWorks11.0

## Category
* Objects - Groups